Repository: FPGAwars/iceIO
Catalog: locale/*/*.po
Languages: es_es

source: InOut-Right_ECP5: InOut block, with the pin on the right side, for ECP5 FPGA Family
es_es: InOut-Right_ECP5: Bloque de Entrada/salida, con el pin en el lado derecho, para la familia ECP5 de FPGAs

source: InOut_ECP5: Input-Output block for the ECP5 FPGA Family
es_es: InOut_ECP5: Bloque de Entrada/Salida para la familia ICE40 de FPGAs

source: InOut-x2-Right_ECP5: 2 bits Input-Output block for the ECP5 FPGA Family (Pin on the Right)
es_es: InOut-x2-Right_ECP5:: Bloque de Entrada/Salida de 2 bits para la familiaECP5 de FPGAs (Pines en la derecha)

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Juntar dos cables en un bus de 2 bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar el bus de 2 bits en dos cables

source: InOut-x2_ECP5: 2 bits Input-Output block for the ECP5 FPGA Family
es_es: InOut-x2_ECP5: Bloque de Entrada/Salida de 2 bits para la familia ECP5 de FPGAs

source: InOut-Right_ICE40: InOut block, with the pin on the right side, for ICE40 FPGA Family
es_es: InOut-Right_ICE40: Bloque de Entrada/salida, con el pin en el lado derecho, para la familia ICE40 de FPGAs

source: InOut_ICE40: Input-Output block for the ICE40 FPGA Family
es_es: InOut_ICE40: Bloque de Entrada/Salida para la familia ICE40 de FPGAs

source: InOut-x2-Right_ICE40: 2 bits Input-Output block for the ICE40 FPGA Family (Pin on the Right)
es_es: InOut-x2_Right_ICE40: Bloque de Entrada/Salida de 2 bits para la familia ICE40 de FPGAs (Pines en la derecha)

source: InOut-x2_ICE40: 2 bits Input-Output block for the ICE40 FPGA Family
es_es: InOut-x2_ICE40: Bloque de Entrada/Salida de 2 bits para la familia ICE40 de FPGAs

source: InOut-x3_ICE40: 3 bits Input-Output block for the ICE40 FPGA Family
es_es: InOut-x3_ICE40: Bloque de Entrada/Salida de 3 bits para la familia ICE40 de FPGAs

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Separar el bus de 3 bits en dos cables

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus3-Join-all: Juntar tres cables en un bus de 3 bits

source: InOut-x4_ICE40: 4 bits Input-Output block for the ICE40 FPGA Family
es_es: InOut-x4_ICE40: Bloque de Entrada/Salida de 4 bits para la familia ICE40 de FPGAs

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar el bus de 4 bits en sus cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Juntar todos los cables en un bus de 4-bits

source: Pull-up_ICE40:: FPGA internal pull-up configuration on the input port. ICE40 FPGA family
es_es: Pull-up_ICE40: Configuración del pull interno de la FPGA en el puerto de entrada. Familia de FPGA ICE40

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro Pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo se puede conectar un pin de FPGA aquí!!!

source: The pull-up is connected by default
es_es: El pull-up se conecta por defecto

source: Pull-upx1_ICE40: 2 internal pull-up configuration on the input port. ICE40 FPGA family
es_es: Pull-upx1_ICE40: Configuración de dos pull-ups internos en el puerto de entrada. Familia de fPGA ICE40

source: The pull-ups are connected by default
es_es: Los pull-ups se conectan por defecto

source: 3 FPGA internal pull-ups
es_es: 3 Pull-ups internos de la FPGA

source: 4 FPGA internal pull-ups
es_es: 4 Pull-ups internos de la FPGA

source: 8 FPGA internal pull-ups
es_es: 8 Pull-ups internos de la FPGA

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Juntar las dos mitades en un bus de 8-bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8 bits en dos buses del mismo tamaño

source: # INDEX: IceIO Collection
es_es: # íNDICE: Colección IceIO

source: Constant bit 0
es_es: Bit 0 constante

source: Input pin (Manually configured)
es_es: Pin de entrada (Configurado manualmente)

source: **InOut block**
es_es: **Bloque InOut**

source: Configure as an input
es_es: Configurar como una entrada

source: ## Manual configuration of an input pin Example of how the IO block is used for configuring a pin as input The input pin is shown on a LED
es_es: ## Configuración manual de un pin de entrada Ejemplo de cómo usar un bloque IO para configurar un pin como entrada El pin de entrada se muestra en un LED

source: **ICE40 FPGA family**
es_es: **Familia de FPGAs ICE40**

source: Input pins (Manually configured)
es_es: Pines de entrada (Configurados manualmente)

source: ## Manual configuration of two input pins The two pins are configured as input and shown on two LEDs
es_es: ## Configuración manual de dos pines de entrada Los dos pines se configura como entrada y se muestran en dos LEDs

source: 1-bit constant
es_es: Constante 1 , de 1-bit

source: Output pin
es_es: Pin de salida

source: wifi_gpio0 should be 0 if wifi is not used
es_es: wifi_gpio0 se debe poner a cero si la wifi no se usa

source: **ECP5 FPGA family**
es_es: **Familia de FPGAs ECP5**

source: ### ULX3S Configuration
es_es: ### Configuración de la ULX3S

source: Constant bit 1
es_es: Bit 1 constante

source: sysclk_divN_24bits: Generate a signal from the division of the system clock by N. (24-bits precision) (N = 2,3,4,..,0x1000000))
es_es: sysclk_divN_24bits: Generar una señal a partir de la división del reloj del sistema por N. (precisión de 24 bits) (N = 2,3,4,..,0x1000000))

source: Generic: 24-bits k-1 constant (Input values: 1,2,...,h1000000). It returns the value input by the user minus 1. Outputs: 0,1,2,...,FFFFFF
es_es: Generic: Constante k-1 de 24-bits (Valores de entrada: 1,2,...,h1000000). Devuelve el valor introducido por el usuario menos 1. Salida: 0,1,2,...,FFFFFF

source: Comp2-24bit: Comparator of two 24-bit numbers
es_es: Comp2-24bit: Comparador de dos números de 24-bits

source: Comp2-8bit: Comparator of two 8-bit numbers
es_es: Comp2-8bit: Comparador de dos números de 8 bits

source: Comp2-4bit: Comparator of two 4-bit numbers
es_es: Comp2-4bit: Comparador de dos números de 4 bits

source: Comp2-1bit: Comparator of two 1-bit numbers
es_es: Comp2-1bit: Comparador de dos números de 1 bit

source: XOR gate: two bits input xor gate
es_es: XOR: Puerta XOR de dos entradas de 1 bit

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Three bits input And gate
es_es: Puerta AND de tres entradas de bit

source: Two bits input And gate
es_es: PUerta AND de dos entradas de 1 bit

source: Bus24-Split-one-third: Split the 24-bits bus into three buses of the same size
es_es: Bus24-Split-one-third: Separar el bus de 24-bits en tres buses del mismo tamaño

source: 24-bits Syscounter with reset
es_es: Contador del sistema de 24 bits, con reset

source: DFF-rst-x24: 24 D flip-flops in paralell with reset
es_es: DFF-rst-x24: 24 Biestables D en paralelo, con reset

source: Bus24-Join-one-third: Join the three buses into an 24-bits Bus
es_es: Bus24-Join-one-third: Juntar los tres buses en uno de 24 bits

source: DFF-rst-x08: Eight D flip-flops in paralell with reset
es_es: DFF-rst-x08: Ocho biestables D en paralelo, con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres biestables D en paralelo con reset

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el DFF es 0

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en verilog)

source: Inc1-24bit: Increment a 24-bits number by one
es_es: Inc1-24bit: Incrementar un número de 24-bits en uno

source: AdderK-24bit: Adder of 24-bit operand and 24-bit constant
es_es: AdderK-24bit: Sumador de un operando y una constante de 24 bits

source: Generic: 24-bits generic constant
es_es: Generic: Constante genérica de 24-bits

source: Adder-24bits: Adder of two operands of 24 bits
es_es: Adder-24bits: Sumador de dos operandos de 24 bits

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operndos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: Adderc-1bit: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: OR2: Two bits input OR gate
es_es: OR2: PUerta OR de entradas de 2 bits

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bits: Sumador de dos operandos de 4 bits y el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bits: Sumador de dos operandos de 8 bits y acarreo de entrada

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Juntar las dos mitades en un bus de 16 bits

source: Bus24-Split-16-8: Split the 24-bits bus into two buses of 16 and 8 wires
es_es: Bus24-Split-16-8: Separar el bus de 24-bits en dos buses de 16 6 8 cables

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Separar el bus de 16 bits en dos buses del mismo tamaño

source: Bus24-Join-8-16: Join the two buses into an 24-bits Bus
es_es: Bus24-Join-8-16: Juntar los dos buses en uno de 24-bits

source: Counter-x01: 1-bit counter
es_es: Counter-x01: Contador de 1 bit

source: Reg: 1-Bit register
es_es: Reg: Registro de 1 bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor de 2 a 1 (Canales de 1 bit). Versión invertida

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2 a 1 (Canales de 1 bit)

source: Output pin (Manually configured)
es_es: Pin de salida (Configurado manualmente)

source: **InOut-right block**
es_es: **Bloque InOut-right**

source: Configure as an output
es_es: Configurar como una salida

source: ## Manual configuration of an output pin Example of how the IO block is used for configuring a pin as output The LED is blinking
es_es: ## Configuración manual de un pin de salida Ejemplo de cómo usar el bloque IO para configurar un pin como salida El LED parpadea

source: T flip-flop
es_es: Biestable T

source: Output: 0,1,2,...,hffffff
es_es: Salida: 0,1,2,...,hffffff

source: Inputs: 1,2,...,h1000000
es_es: Entradas: 1,2,...,h1000000

source: Output
es_es: Salida

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activo a nivel alto Cuando rst=1, el DFF se inicializa a 0

source: Data input
es_es: Dato de entrada

source: System clock
es_es: Reloj del sistema

source: Initial default value: 0
es_es: Valor inicial por defecto: 0

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Dato de entrada

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Output pins (Manually configured)
es_es: Pines de salida (Configurados manualmente)

source: **InOut-x2-right block**
es_es: **Bloque InOut-x2-right**

source: ## Manual configuration of two output pins Example of how the IO block is used for configuring two pins as outputs The two LEDs are blinking alternatively
es_es: ## Configuración manual de dos pines de salida Ejemplo de cómo usar el bloque IO para configurar dos pines como salida Los dos LEDs parpadean alternativamente

source: Input/Output pin Connect to D1 or D2 by an external wire
es_es: Pin de entrada/salida Conectar a D1 o D2 mediante un cable externo

source: Configure as input/output: * 0: Input * 1: Output
es_es: Configurar como entrada/salida: * 0: Entrada * 1: Salida

source: ## Manual configuration of an input/output pin Example of how the IO block is used for configuring a pin as input/output The button SW2 is used for configuring the pin as input (0) or output (1) When input, the bit read is shown on the LED0. When output, a 1-sec square signal is written The D0 input/output pin is connected externally (by a wire) to the D1 or D2 pins. The SW1 button is conected to D1, and the D2 pin is conected to LED7
es_es: ## Configuración manual de un pin de entrada/salida Ejemplo de cómo configurar el bloque IO como pin de entrada/salida El botón SW2 se usa para configurar el pin como entrada (0) o salida (1) Cuando es de entrada, el bit leído se muestra por LED0. Cuando es de salida, se genera una señal cuadrada de 1 segundo El pin de entrada/salida D0 se conecta externamente (mediante un cable) a los pines D1 o D2. El botón SW1 se conecta a D1, y el pin D2 se conecta a LED7

source: 1 when configured as input
es_es: 1 Cuando se configura como entrada

source: Connect to D0 using an external wire
es_es: Conectar a D0 mediante un cable externo

source: 1-sec period square signal
es_es: Señal cuadrada de 1 segundo de periodo

source: Input/Output pin Connect to GN1 or GN2 by an external wire
es_es: Pin de Entrada/Salida Conectar a GN1 o GN2 mediante un cable externo

source: ## Manual configuration of an input/output pin Example of how the IO block is used for configuring a pin as input/output The button B1 is used for configuring the pin as input (0) or output (1) When input, the bit read is shown on the LED2. When output, a 1-sec square signal is written on LED1 The GN0 input/output pin is connected externally (by a wire) to the GN1 or GN2 pins. The B1 button is conected to GN1, and the GN2 pin is conected to LED1
es_es: ## Configuración manual de un pin de entrada/salida Ejemplo de cómo configurar un pin como entrada (0) o salida (1) Cuando es de entrada, el bit leído se muestra por el LED2. Cuando es de salida, una señal cuadrada de 1 segundo se muestra por el LED1 El pin de entrada/salida GN0 se conecta externamente (mediante un cable) a los pines GN1 y GN2. El botón B1 se conecta a GN1, y el pin GN2 se conecta al LED1

source: Connect to GN0 using an external wire
es_es: Conectar a GN0 usando un cable externo

source: ## Testing one pull-up The button state can be seen on the LED0 * Button not pressed: LED0 on * Button pressed: LED0 off
es_es: ## Probando un pull-up El estado del botón se muestra en el LED0 * Botón no apretado: LED0 encendido * Botón apretado: LED0 apagado

source: The pull-up is active by default It can be disconnected by setting the parameter to 0
es_es: El pull-up está activo por defecto Se puede desconectar poniendo el parámetro a 0

source: ## Testing two pull-ups The buttons state is shown on LED0 and LED1
es_es: ## Probando dos pull-ups El estado de los botones se muestra en los LEDs 0 y 1

source: The pull-ups are active by default They can be disconnected by seting the parameter to 0
es_es: Los pull-ups están activos por defecto Se pueden desconectar poniendo el parámetro a 0

source: Buttons
es_es: Botones

source: ## Testing three pull-ups The buttons state is shown on the LEDs
es_es: ## Probando tress pull-ups El estado de los botones se muestra en los LEDs

source: ## Manual configuration of three input pins The pins are configured as inputs and shown on LEDs
es_es: ## Configuración manual de tres pines de entrada Los pines se configuran como entrada y se muestran en los LEDs

source: ## Manual configuration of four input pins The pins are configured as inputs and shown on LEDs
es_es: ## Configuración manual de cuatro pines de entrada Los pines se configuran como entrada y se muestran en los LEDs

source: ## Pull-up-x03: Manual testing The buttons state is shown on the LEDs
es_es: ## Pull-up-x03: Prueba manual El estado de los botones se muestra en los LEDs

source: ## Pull-up-x04: Manual testing The buttons state is shown on the LEDs
es_es: ## Pull-up-x04: Prueba manual El estado de los botones se muestra en los LEDs

source: ## Pull-up-x08: Manual testing The buttons state is shown on the LEDs
es_es: ## Pull-up-x08: Prueba manual El estado de los botones se muestra en los LEDs
